---
type: NumberSystem
namespace: Autodesk.Revit.DB
version: 2024
members: 11
tags: [revit-api, class]
---

# NumberSystem

`Autodesk.Revit.DB.NumberSystem` · Revit 2024 · 11 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Create | — | `` |
| Method | GetReferencePick | 2013 | `public Reference GetReferencePick ()` |
| Method | SetReferencePick | 2013 | `public void SetReferencePick ( Reference referencePick )` |
| Property | JustifyOffset | 2013 | `public double JustifyOffset { get ; set ; }` |
| Property | JustifyOption | 2013 | `public NumberSystemJustifyOption JustifyOption { get ; set ; }` |
| Property | NumberDisplayRule | 2013 | `public NumberSystemDisplayRule NumberDisplayRule { get ; set ; }` |
| Property | NumberOrientation | 2013 | `public TagOrientation NumberOrientation { get ; set ; }` |
| Property | NumberedElementId | 2013 | `public LinkElementId NumberedElementId { get ; }` |
| Property | Parameter | — | `` |
| Property | PlacementLevelId | 2018 | `public LinkElementId PlacementLevelId { get ; }` |
| Property | ReferenceOffset | 2013 | `public double ReferenceOffset { get ; set ; }` |